#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.archive_file.zip_the_python_code: Reading...
data.aws_vpc.vpc: Reading...
data.aws_security_group.rds_sg: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_db_instance.tc_pedidos_db: Reading...
data.aws_db_instance.tc_acompanhamento_db: Reading...
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
data.aws_db_instance.tc_pedidos_db: Read complete after 0s [id=tc-pedidos-db]
data.aws_db_instance.tc_acompanhamento_db: Read complete after 0s [id=tc-acompanhamento-db]
data.archive_file.zip_the_python_code: Read complete after 0s [id=3e831ac9d7437ac80bb09238b5036d6a1dd380c8]
data.aws_security_group.rds_sg: Read complete after 0s [id=sg-0943ad0e28fa4a179]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-0007de5a3b5c513a5]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-0f9b75aec58a26762"]: Reading...
data.aws_subnet.subnet["subnet-031c38d9feff86746"]: Reading...
data.aws_subnet.subnet["subnet-02d73fe82246eb0f5"]: Reading...
data.aws_subnet.subnet["subnet-0c09c43199d92bca0"]: Reading...
data.aws_subnet.subnet["subnet-0f9b75aec58a26762"]: Read complete after 0s [id=subnet-0f9b75aec58a26762]
data.aws_subnet.subnet["subnet-031c38d9feff86746"]: Read complete after 0s [id=subnet-031c38d9feff86746]
data.aws_subnet.subnet["subnet-02d73fe82246eb0f5"]: Read complete after 0s [id=subnet-02d73fe82246eb0f5]
data.aws_subnet.subnet["subnet-0c09c43199d92bca0"]: Read complete after 0s [id=subnet-0c09c43199d92bca0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.every_15_minutes will be created
  + resource "aws_cloudwatch_event_rule" "every_15_minutes" {
      + arn                 = (known after apply)
      + description         = "trigger lambda every 15 minute"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "every_15_minutes_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(15 minutes)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "every_15_minutes_rule"
      + target_id      = "SendToLambda"
    }

  # aws_lambda_function.terraform_lambda_func will be created
  + resource "aws_lambda_function" "terraform_lambda_func" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./lambda/remover-pedidos.zip"
      + function_name                  = "RemoverPedidos"
      + handler                        = "remover_pedidos.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::318849967381:role/LabRole"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "9ul1spEK/E7lpAQvQMiYL41tbnZwcdxT5ADgj3dzhgA="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACOMPANHAMENTO_DB_HOST"     = "tc-acompanhamento-db.cnkxtuzp2zqj.us-east-1.rds.amazonaws.com"
              + "ACOMPANHAMENTO_DB_NAME"     = "acompanhamento_db"
              + "ACOMPANHAMENTO_DB_PASSWORD" = "banana123"
              + "ACOMPANHAMENTO_DB_USER"     = "postgres"
              + "PEDIDOS_DB_HOST"            = "tc-pedidos-db.cnkxtuzp2zqj.us-east-1.rds.amazonaws.com"
              + "PEDIDOS_DB_NAME"            = "pedidos_db"
              + "PEDIDOS_DB_PASSWORD"        = "banana123"
              + "PEDIDOS_DB_USER"            = "postgres"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0943ad0e28fa4a179",
            ]
          + subnet_ids                  = [
              + "subnet-02d73fe82246eb0f5",
              + "subnet-031c38d9feff86746",
              + "subnet-0c09c43199d92bca0",
              + "subnet-0f9b75aec58a26762",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "RemoverPedidos"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @BrunaPisera, Action: `pull_request`*